### Ćwiczenie - ekstrakcja cech.

1. Pobierz wolumeny giełdowe Amazona za pomocą podanej poniżej funkcji, zapisz do zmiennej, stwórz kopie, weź 5 pierwszych wartości:
- wydobądź z indeksu, dni, miesiące, lata i stwórz nowe zmienne
- zresetuj indeks i wyciagnij powyższe


2. Dyskretyzacja zmiennej ciągłej - df = pd.DataFrame(data={'height': [175., 178.5, 185., 191., 184.5, 183., 168.]}) :

- za pomocą odpowiedniej funkcji w pandas stwórz trzy przedzialy (automatycznie)
- za pomocą odpowiedniej funkcji w pandas stwórz trzy przedzialy (ręcznie)
- zmapuj te przedziały do odpowiednich wartośći (low, medium, high)
- sprowadź do postaci zero jedynkowej za pomocą get dummies


3. Ekstrakcja cech - df = pd.DataFrame(data= {'lang': [['PL', 'ENG'], ['PL', 'ENG', 'RUS', 'GER'], ['RUS']]})

- stwóz nową zmienną liczącą ile jest języków w danej aplikacji (wiersz), za pomocą lambdy
- kolejna zmienna - flaga pl, tablica 0,1 dla języka polskiego, lambda


4. Ekstrakcja cech - df = pd.DataFrame({'website': ['www.google.com', 'www.zambrow.org', 'www.facebook.com', 'www.onet.pl']})

- rozdziel na domene i rozszerzenie

In [2]:
# pobieranie danych poprzez pandas_datareader.data

def fetch_financial_data(company='AMZN'):
    """
    This function fetches stock market quotations.
    """
    
    import pandas_datareader.data as web
    
    return web.DataReader (name=company, data_source='stooq')

In [3]:
import numpy as np
import pandas as pd
import sklearn

In [4]:
df_raw = fetch_financial_data()

In [5]:
df = df_raw.copy()

In [6]:
df

               Open       High       Low    Close   Volume
Date
2021-11-12  3485.00  3540.7262  3447.050  3525.15  2689434
2021-11-11  3513.00  3543.2400  3467.470  3472.50  2264406
2021-11-10  3563.87  3605.4500  3463.090  3482.05  4027422
2021-11-09  3515.25  3593.7700  3501.425  3576.23  4294922
2021-11-08  3523.24  3579.0000  3487.860  3488.98  3073992
...             ...        ...       ...      ...      ...
2016-11-22   788.17   792.4000   781.000   785.33  5106920
2016-11-21   766.00   780.3500   765.110   780.00  4560974
2016-11-18   761.00   767.7400   757.644   760.16  4227993
2016-11-17   749.32   757.5000   748.000   756.39  3503295
2016-11-16   739.88   749.8700   735.610   746.49  3545800

[1257 rows x 5 columns]

In [11]:
df['day'] = df.index.day
df['month'] = df.index.month
df['year'] = df.index.year

In [13]:
df.reset_index(inplace=True)

In [18]:
df.drop(axis=1, columns=['day', 'month', 'year'], inplace=True)

In [22]:
df['day'] = df['Date'].dt.day
df['month'] = df['Date'].dt.month
df['year'] = df['Date'].dt.year

In [24]:
df = df.head()

In [25]:
df

        Date     Open       High       Low    Close   Volume  day  month  year
0 2021-11-12  3485.00  3540.7262  3447.050  3525.15  2689434   12     11  2021
1 2021-11-11  3513.00  3543.2400  3467.470  3472.50  2264406   11     11  2021
2 2021-11-10  3563.87  3605.4500  3463.090  3482.05  4027422   10     11  2021
3 2021-11-09  3515.25  3593.7700  3501.425  3576.23  4294922    9     11  2021
4 2021-11-08  3523.24  3579.0000  3487.860  3488.98  3073992    8     11  2021

## 2.

In [26]:
df = pd.DataFrame(data={'height': [175., 178.5, 185., 191., 184.5, 183., 168.]})

In [29]:
df['height_cat'] = pd.cut(df['height'], bins=3)

In [30]:
df

   height          height_cat
0   175.0  (167.977, 175.667]
1   178.5  (175.667, 183.333]
2   185.0    (183.333, 191.0]
3   191.0    (183.333, 191.0]
4   184.5    (183.333, 191.0]
5   183.0  (175.667, 183.333]
6   168.0  (167.977, 175.667]

In [37]:
df['height_cat'] = pd.cut(df['height'], bins=(160,175,185,198), labels = ['small','medium','high'])

In [39]:
df

   height height_cat
0   175.0      small
1   178.5     medium
2   185.0     medium
3   191.0       high
4   184.5     medium
5   183.0     medium
6   168.0      small

In [43]:
df = pd.get_dummies(df, columns=['height_cat'], drop_first=True)

In [44]:
df

   height  height_cat_medium  height_cat_high
0   175.0                  0                0
1   178.5                  1                0
2   185.0                  1                0
3   191.0                  0                1
4   184.5                  1                0
5   183.0                  1                0
6   168.0                  0                0

## 3.

In [45]:
df = pd.DataFrame(data= {'lang': [['PL', 'ENG'], ['PL', 'ENG', 'RUS', 'GER'], ['RUS']]})

In [46]:
df

                  lang
0            [PL, ENG]
1  [PL, ENG, RUS, GER]
2                [RUS]

In [47]:
df['len'] = df['lang'].apply(lambda x: len(x))

In [48]:
df

                  lang  len
0            [PL, ENG]    2
1  [PL, ENG, RUS, GER]    4
2                [RUS]    1

In [51]:
df['pl_true'] = df['lang'].apply (lambda x: 1 if 'PL' in x else 0)

## 4.

In [55]:
df = pd.DataFrame({'website': ['www.google.com', 'www.zambrow.org', 'www.facebook.com', 'www.onet.pl']})

In [60]:
columns = df['website'].str.split('.', expand=True)

In [64]:
df['site'] = columns[1]
df['domain'] = columns[2]

In [65]:
df

            website      site domain
0    www.google.com    google    com
1   www.zambrow.org   zambrow    org
2  www.facebook.com  facebook    com
3       www.onet.pl      onet     pl